#Найдите сумму цифр трехзначного числа.

#print("Введите первое число: ")
#a = input()
#print("Введите второе число: ")
#b = input()
#print("Введите третье число: ")
#c = input()
#print(a, " + ", b, " + ", c, " = ", a + b + c)

#Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

#s = int(input())
#print((s//6), ((s//6)*4), (s//6))

#Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

# a = int(input())
# b = int(input())
# c = int(input())
# d = int(input())
# e = int(input())
# f = int(input())


#if((a + b + c) == (d + e + f)):
    #print("Счастливый билет")
#else:
    #print("Несчастливый билет")

# Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

#a = int(input())
#b = int(input())
#c = int(input())

#if (c < a * b and (c % a == 0) or (c % b ==0)):
    #print("Yes")
#else:
    #print("No")